
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстXml 		= Обработки.РазборРазметки.ПолучитьТестовыйXML();
	ТекстПримера 	= Обработки.РазборРазметки.ПолучитьТекстПримера();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьТестыНаСервере()
	Обработки.РазборРазметки.ВыполнитьТесты();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТесты(Команда)
	ВыполнитьТестыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПримерНаСервере()
	Выполнить(Обработки.РазборРазметки.ПолучитьТекстПримера());
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПример(Команда)
	ВыполнитьПримерНаСервере();
КонецПроцедуры
